# encoding:utf-8

diagnoselib = {
"001":"舌象特征：舌色红润，鲜明光泽，运动自如。临床意义：见于健康之人或初病轻浅，预后良好者。",
"002":"舌象特征：舌色晦暗，活动呆滞。临床意义：气血阴阳皆衰，生机已微，预后较差。",
"003":"舌象特征：舌色淡红润泽。临床意义：见于健康之人，或外感初起，病情轻浅，气血内脏未伤。",
"004":"舌象特征：舌色较正常舌淡，若舌全无血色则称枯白舌。临床意义：主虚证、寒证或气血两亏；枯白舌为夺气脱血。",
"005":"舌象特征：舌色较淡红舌深，甚者呈鲜红。临床意义：主热证。",
"006":"舌象特征：舌红色更深。临床意义：热入营血或阴虚火旺，或血行不畅。",
"007":"舌象特征：全舌色呈紫暗，或绛紫，或青紫，或舌的局部呈现青紫色的斑、点。临床意义：轻者气血运行不畅，甚者瘀血。",
"008":"舌象特征：舌质纹理粗糙，形色坚敛苍老。临床意义：主实证。",
"009":"舌象特征：舌体浮胖娇嫩，纹理细腻，舌色浅淡。临床意义：主虚证。",
"010":"舌象特征：较正常舌体大而厚，甚者伸舌满口。临床意义：主水湿痰饮证。",
"011":"舌象特征：舌体红肿而大，盈口满嘴，甚者不能闭口，不能缩回。临床意义：主热郁、中毒。",
"012":"舌象特征：舌体瘦小而薄。临床意义：主气血两虚，阴虚血旺。",
"013":"舌象特征：点指鼓起于舌面的红色、白色或黑色星点；刺指舌面上的软刺高起突出舌面，形成芒刺，摸之棘手。临床意义：主热盛。",
"014":"舌象特征：舌面上深浅不一，形态各异的沟裂。临床意义：主阴血亏虚。",
"015":"舌象特征：舌边缘有牙齿压迫的痕迹，多伴舌体胖大。亦有舌体不胖大而出现齿痕，是舌质轿内的齿痕舌。临床意义：主脾虚、水湿内盛。",
"016":"舌象特征：透过舌苔能隐隐见到舌质（称见底）。临床意义：（一般反映病位的深浅）病位浅、常见于外感表证，或内伤轻病。",
"017":"舌象特征：透过舌苔不能见到舌质（称不见底）。临床意义：（一般反映病位的深浅）病位深，常见于内伤有痰饮、湿浊、食积等里证。",
"018":"舌象特征：舌苔干湿适中。临床意义：（可了解津液的盛衰）津液未伤。",
"019":"舌象特征：舌苔津液过多，甚者伸舌欲滴。临床意义：（可了解津液的盛衰）痰饮水湿内停。",
"020":"舌象特征：舌苔干燥少津。临床意义：（可了解津液的盛衰）热盛伤津。",
"021":"舌象特征：舌质毫无水分，苔质粗糙，甚者糙裂。临床意义：（可了解津液的盛衰）热盛伤涸。",
"022":"舌象特征：苔质颗粒细腻致密，揩之不去，刮之不脱，舌面如涂油腻状黏液。临床意义：湿浊，痰饮，食积，湿热。",
"023":"舌象特征：苔质颗粒疏松，粗大而厚，形如豆腐渣堆积舌面，揩之可去。临床意义：食积胃肠，痰浊内蕴。",
"024":"舌象特征：舌苔全部或部分脱落。临床意义：胃气大伤，胃阴枯竭，气血两虚。",
"025":"舌象特征：舌苔呈现白色。临床意义：主表证、寒证。",
"026":"舌象特征：舌苔呈现黄色。临床意义：主里证、热证。",
"027":"舌象特征：舌苔呈现浅黑色。临床意义：主里证，常见于里热证，也见于寒湿证。",
"028":"舌象特征：舌苔呈现黑色。临床意义：主里证，或为热极，或为寒盛。",
}

class MyToken(object):
    BAIDUTOKEN_EXPIRE = "INIT"
    BAIDUTOKEN = "INIT"



